Revit 2024 API
SATExportOptions Members
The SATExportOptions type exposes the following members.
Constructors
Name | Description
SATExportOptions()
 Constructs a new instance of SATImportOptions with default values of all properties.
SATExportOptions(SATExportOptions)
 Constructs a new instance of SATImportOptions as a copy of the export options.
Methods
Name | Description
Dispose
Releases all resources used by the SATExportOptions
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
SATExportOptions Class
Autodesk.Revit.DB Namespace